//
//  myFeedContainer.swift
//  proco
//
//  Created by 이은호 on 2020/11/25.
//

import SwiftUI
import Foundation
import Combine

class myFeedContainer : ObservableObject {
    @Published var my_feeds = [my_feed]()
    init() {
        self.my_feeds = [
            my_feed(image: "hopStorkCoffee", name: "다나야", time: "2020.01.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"),
               my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.01.02", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.01.02", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.01.03", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.03.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.11.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2021.01.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2022.01.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.05.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.08.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.07.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"), my_feed(image: "hopStorkCoffee", name: "가나", time: "2020.03.01", type: "지금볼래", feed_image: ["nuareCoffee", "mallCafe", "outpostCoffee"], tags: ["첫번째", "두번째", "세번째"], memo: "😀 😃 😄 😁 😆 😅 😂 🤣 ☺️ 😊 😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋 😛 😝 😜 🤪 🤨 🧐 🤓 😎 🤩 🥳 😏 😒 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫 😩 🥺 😢 😭 😤 😠 😡 🤬 🤯 😳 🥵 🥶 😱 😨 😰 😥 😓 🤗 🤔 🤭 🤫 🤥 😶 😐 😑 😬 🙄"),
        ]
        
        
        
    }
}

struct my_feed : Identifiable, Hashable{
    let  id = UUID()
    let  image : String
    let name : String
    let  time : String
    let type : String
    let feed_image : [String]
    let tags : [String]
    let memo : String
}


